PMo_manipulated/Graphviz/50.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "StartNoneEvent" -> "Claim is registered";
  "Claim is registered" -> "Claim is examined by\na claims officer";
  "Claims officer\nwrites a settlement\nrecommendation" -> "Recommendation is\nchecked by a senior\nclaims officer";
  "Recommendation is\nchecked by a senior\nclaims officer" -> "Senior claims\nofficer marks the\nclaim";
  "Senior claims\nofficer marks the\nclaim" -> "ExclusiveGateway_1";
  "Claim is examined by\na claims officer" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Claims officer\nwrites a settlement\nrecommendation";
  "ExclusiveGateway_1" -> "Claim handling\nprocess proceeds" [label="OK"];
  "ExclusiveGateway_1" -> "Claim is sent back" [label="Not OK"];
  "Claim handling\nprocess proceeds" -> "EndNoneEvent";
  "ExclusiveGateway_2" -> "Senior claims\nofficer marks the\nclaim";

  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
}
