pmo-dataset/mermaid/50.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartNoneEvent_1((" ")) --> Task_1["Claim is registered"]
	Task_1 --> Task_2["Claim is examined by\na claims officer"]
	Task_3["Claims officer\nwrites a settlement\nrecommendation"] --> Task_4["Recommendation is\nchecked by a senior\nclaims officer"]
	Task_4 --> Task_5["Senior claims\nofficer marks the\nclaim"]
	Task_5 --> ExclusiveGateway_1{"X"}
	Task_2 --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_2 --> Task_3
	Task_6["Claim is sent back"] --> ExclusiveGateway_2
	ExclusiveGateway_1 -->|"OK"| Task_7["Claim handling\nprocess proceeds"]
	ExclusiveGateway_1 -->|"Not OK"| Task_6
	Task_7 --> EndNoneEvent_1((" ")):::endEvent
